import bpy
import bmesh

# آرایه‌ای از نقاط (مثال)
points =[(15,0,37), (-15,0,37), (0,12,11), (-59,-1,-3), (59,-1,-3), (-43,7,-19), (43,7,-19), (63,-3,-19),(-63,-3,-19), (0,12,-19), (-15,-11,-19), (15,-11,-19), (-17,3,-19), (-3,5,-19), (3,5,-19), (17,3,-19),(17,-5,-19), (3,-7,-19), (-3,-7,-19), (-17,-5,-19), (0,0,37), (0,0,44), (-39,-2,-19), (-39,2,-19),(-43,0,-19), (39,2,-19), (43,0,-19), (39,-2,-19), (63,-3,-19), (-63,-3,-19)]

# لبه‌ها بین نقاط (مثال)
edges = [(0,2), (0,1), (1,2), (1,5), (2,5), (0,6), (2,6), (1,3), (3,5), (0,4), (4,6), (2,9), (5,9), (6,9), (3,8), (5,8), (4,7), (6,7), (7,11), (10,11), (8,10), (1,10), (0,11), (14,17), (14,15), (15,16), (16,17), (12,19), (12,13), (13,18), (18,19), (22,23), (22,24), (23,24), (25,27), (25,26), (26,27)]

# ایجاد یک مش و یک شیء جدید
mesh = bpy.data.meshes.new(name="CobraMesh")
obj = bpy.data.objects.new(name="CobraObject", object_data=mesh)

# اضافه کردن شیء به صحنه
bpy.context.collection.objects.link(obj)

# ایجاد یک BMesh برای اضافه کردن نقاط و لبه‌ها
bm = bmesh.new()

# اضافه کردن نقاط به BMesh
verts = [bm.verts.new(point) for point in points]

# اضافه کردن لبه‌ها بین نقاط
for edge in edges:
    bm.edges.new((verts[edge[0]], verts[edge[1]]))

# به‌روزرسانی مش با داده‌های BMesh
bm.to_mesh(mesh)
bm.free()

# انتخاب و فعال کردن شیء جدید
bpy.context.view_layer.objects.active = obj
obj.select_set(True)